console.log(
'Комментарии: Логика игры отличается от демо, и следовательно не соответствует требованиям,\n',
'во первых карточки не переворачиваются обратно если они не совпадают, это сделано потому, что так как\n',
'я добавила три уровня, и добавила фунуционал исчезновения карточек, я подумала что это будет слишком утомительно\n',
'кликать всегда по две карточки чтоб запомнить последовательность, вместо этого две карточки при открытии просто\n',
'лежат на борде, и только при клике на третью скрываются, после завершения трех уровней игра закончена и результат\n','сохранен, дополнительно добавлена музыка, которая отключена по умолчанию, но ее можно включить кликом на кнопку, это\n','технически дополнительный функционал(как и три уровня вместо одного)\n',

'Score: 65/60\n',


    '1. Вёрстка [10/10]\n',
'    --реализован интерфейс игры [5/5]\n',
  '  --в футере приложения есть ссылка на гитхаб автора приложения, год создания приложения\n',
   'логотип курса со ссылкой на курс [5/5]\n',

'    2. Логика игры. Карточки, по которым кликнул игрок, переворачиваются согласно правилам игры [10/10]\n',

'   3. Игра завершается, когда открыты все карточки [10/10]\n',

'4. По окончанию игры выводится её результат - количество ходов, которые понадобились для завершения игры [10/10]\n',

'5. Результаты последних 10 игр сохраняются в local storage. Есть таблица рекордов,\n',
 'в которой сохраняются результаты предыдущих 10 игр [10/10]\n',
'6. По клику на карточку – она переворачивается плавно, если пара\n',
 'не совпадает – обе карточки так же плавно переварачиваются рубашкой вверх [5/10]\n',

'7. Очень высокое качество оформления приложения и/или дополнительный\n',
 'не предусмотренный в задании функционал, улучшающий качество приложения [10/10]\n',

'--высокое качество оформления приложения предполагает собственное оригинальное\n',
 'оформление равное или отличающееся в лучшую сторону по сравнению с демо\n'


)